<!-- dflook/terraform-github-actions {"workspace":"ephemeral-2","backend_type":"remote","backend":"eeced294ba5d30e539a5fb67212b29251fc09cb60bfc3401172140db37d82ade","plan_job_ref":"Job Test Terraform cloud #276 at https://github.com/dflook/terraform-github-actions/actions/runs/12750796502","plan_hash":"087a57d371e1b17987a1040932ee396a875e85f135ac46fbb2a43a3fbd9b63c9","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __ephemeral-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #276](https://github.com/dflook/terraform-github-actions/actions/runs/12750796502)